Revit 2027 API
AnalysisDisplayStyleMarkerType Enumeration
 Marker types for Markers and Text settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleMarkerType
Public Enumeration AnalysisDisplayStyleMarkerType
public enum class AnalysisDisplayStyleMarkerType
type AnalysisDisplayStyleMarkerType
Members
Member name | Value | Description
Circle | 0
Square | 1
Triangle | 2
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace